dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
#define STM32F107xC
#define STM32F1

#include <stdint.h>
#include <type_traits>

#include "mcutl/interrupt/interrupt.h"
#include "mcutl/periph/periph_defs.h"
#include "mcutl/rtc/rtc.h"
#include "mcutl/tests/mcu.h"
#include "mcutl/utils/duration.h"
#include "mcutl/utils/type_helpers.h"

#include "gtest/gtest.h"
#include "gmock/gmock.h"

#include "tests/stm32f1_backup_test_fixture.h"
#include "tests/stm32f1_exti_interrupt_test_fixture.h"

class rtc_strict_test_fixture : public backup_strict_test_fixture,
	public exti_interrupt_test_fixture
{
public:
	void enable_interrupt(uint32_t irqn)
	{
		memory().allow_reads(addr(&(NVIC->ISER[RTC_IRQn / 32])));
		memory().allow_reads(addr(&(NVIC->ISER[RTC_Alarm_IRQn / 32])));
		memory().set(addr(&(NVIC->ISER[irqn / 32])), 1 << (irqn % 32));
	}
	
	void expect_reset_backup_domain(uint32_t bdcr)
	{
		::testing::InSequence s;
		EXPECT_CALL(memory(), write(addr(&RCC->BDCR), bdcr | RCC_BDCR_BDRST));
		EXPECT_CALL(memory(), read(addr(&RCC->BDCR)))
			.Times(2)
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)); })
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)) & ~RCC_BDCR_BDRST; });
	}
	
	void expect_enable_disable_alarm_line(bool enable)
	{
		memory().set(addr(&EXTI->FTSR), 0x12345678);
		memory().set(addr(&EXTI->RTSR), 0x90abcdef);
		memory().set(addr(&EXTI->EMR), 0x12345678);
		memory().set(addr(&EXTI->IMR), 0x90abcdef);
	
		uint32_t ft = 0, rt = 0, em = 0, im = 0;
		uint32_t mask = 1u << 17;
		if (enable)
		{
			rt = EXTI_RTSR_RT17;
			im = EXTI_IMR_IM17;
		}
		
		EXPECT_CALL(memory(), read(addr(&EXTI->FTSR)));
		EXPECT_CALL(memory(), write(addr(&EXTI->FTSR),
			(0x12345678 & ~mask) | ft));
		EXPECT_CALL(memory(), read(addr(&EXTI->RTSR)));
		EXPECT_CALL(memory(), write(addr(&EXTI->RTSR),
			(0x90abcdef & ~mask) | rt));
		EXPECT_CALL(memory(), read(addr(&EXTI->EMR)));
		EXPECT_CALL(memory(), write(addr(&EXTI->EMR),
			(0x12345678 & ~mask) | em));
		EXPECT_CALL(memory(), read(addr(&EXTI->IMR)));
		EXPECT_CALL(memory(), write(addr(&EXTI->IMR),
			(0x90abcdef & ~mask) | im));
	}
	
	void expect_set_rtc_prescaler(uint32_t prescaler)
	{
		EXPECT_CALL(memory(), write(addr(&RTC->PRLL), prescaler & 0xffff));
		EXPECT_CALL(memory(), write(addr(&RTC->PRLH), prescaler >> 16));
	}
	
	void expect_enable_lse(uint32_t bdcr)
	{
		::testing::InSequence s;
		EXPECT_CALL(memory(), write(addr(&RCC->BDCR), bdcr));
		EXPECT_CALL(memory(), read(addr(&RCC->BDCR)))
			.Times(2)
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)) & ~RCC_BDCR_LSERDY; })
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)) | RCC_BDCR_LSERDY; });
	}
	
	void expect_disable_lse(uint32_t bdcr)
	{
		::testing::InSequence s;
		EXPECT_CALL(memory(), write(addr(&RCC->BDCR), bdcr));
		EXPECT_CALL(memory(), read(addr(&RCC->BDCR)))
			.Times(2)
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)) | RCC_BDCR_LSERDY; })
			.WillOnce([this] (auto) { return memory().get(addr(&RCC->BDCR)) & ~RCC_BDCR_LSERDY; });
	}
	
	void expect_enable_lsi()
	{
		::testing::InSequence s;
		EXPECT_CALL(memory(), read(addr(&RCC->CSR)))
			.WillOnce([] (auto) { return 0xffffffff & ~(RCC_CSR_LSION | RCC_CSR_LSIRDY); });
		EXPECT_CALL(memory(), write(addr(&RCC->CSR), 0xffffffff & ~RCC_CSR_LSIRDY));
		EXPECT_CALL(memory(), read(addr(&RCC->CSR)))
			.Times(2)
			.WillOnce([] (auto) { return RCC_CSR_LSION; })
			.WillOnce([] (auto) { return RCC_CSR_LSION | RCC_CSR_LSIRDY; });
	}
	
	void expect_set_bdcr(uint32_t bdcr)
	{
		EXPECT_CALL(memory(), write(addr(&RCC->BDCR), bdcr));
	}
	
	void expect_set_crh(uint32_t crh)
	{
		EXPECT_CALL(memory(), write(addr(&RTC->CRH), crh));
	}
	
	void expect_set_rtc_value()
	{
		::testing::InSequence s;
		expect_enable_backup_writes(false);
		expect_enable_rtc_config(true);
	
		EXPECT_CALL(memory(), write(addr(&RTC->CNTL), 0));
		EXPECT_CALL(memory(), write(addr(&RTC->CNTH), test_timestamp >> 16));
		EXPECT_CALL(memory(), write(addr(&RTC->CNTL), test_timestamp & 0xffff));
	
		expect_disable_rtc_config(true);
		expect_disable_backup_writes(true, false);
	}
	
	void expect_set_alarm_value()
	{
		::testing::InSequence s;
		
		EXPECT_CALL(memory(), write(addr(&EXTI->PR), 1 << mcutl::exti::rtc_alarm_line::value));
		
		expect_enable_backup_writes(false);
		expect_enable_rtc_config(true);
	
		EXPECT_CALL(memory(), write(addr(&RTC->ALRH), test_timestamp >> 16));
		EXPECT_CALL(memory(), write(addr(&RTC->ALRL), test_timestamp & 0xffff));
		
		EXPECT_CALL(memory(), write(addr(&RTC->CRL),
			RTC_CRL_CNF | RTC_CRL_SECF | RTC_CRL_OWF | RTC_CRL_RSF));
	
		expect_disable_rtc_config(true);
		expect_disable_backup_writes(true, false);
	}
	
	void expect_rtc_value_read()
	{
		::testing::Sequence s1, s2;
		expect_enable_rtc_config(false, s1, s2);
		EXPECT_CALL(memory(), read(addr(&RTC->CNTH)))
			.Times(::testing::AtLeast(1))
			.InSequence(s1);
		EXPECT_CALL(memory(), read(addr(&RTC->CNTL)))
			.Times(::testing::AtLeast(1))
			.InSequence(s2);
	}
	
	void expect_enable_rtc_config(bool requires_config_mode,
		const ::testing::Sequence& s1 = {},
		const ::testing::Sequence& s2 = {})
	{
		EXPECT_CALL(memory(), read(addr(&RTC->CRL)))
			.Times(2)
			.InSequence(s1, s2)
			.WillRepeatedly([this] (auto)
			{
				rtoff_ = !rtoff_;
				return rtoff_ ? RTC_CRL_RTOFF : 0;
			});
		
		EXPECT_CALL(memory(), write(addr(&RTC->CRL),
			RTC_CRL_ALRF | RTC_CRL_SECF | RTC_CRL_OWF))
			.InSequence(s1, s2);
		
		EXPECT_CALL(memory(), read(addr(&RTC->CRL)))
			.Times(2)
			.InSequence(s1, s2)
			.WillRepeatedly([this] (auto)
			{
				rsf_ = !rsf_;
				return rsf_ ? (RTC_CRL_RSF | RTC_CRL_RTOFF) : RTC_CRL_RTOFF;
			});
		
		if (requires_config_mode)
		{
			EXPECT_CALL(memory(), write(addr(&RTC->CRL),
				RTC_CRL_CNF | RTC_CRL_ALRF | RTC_CRL_SECF | RTC_CRL_OWF | RTC_CRL_RSF))
			.InSequence(s1, s2);
		}
	}
	
	void expect_disable_rtc_config(bool requires_config_mode)
	{
		::testing::InSequence s;
		
		if (requires_config_mode)
		{
			EXPECT_CALL(memory(), write(addr(&RTC->CRL),
				RTC_CRL_ALRF | RTC_CRL_SECF | RTC_CRL_OWF | RTC_CRL_RSF));
		}
		
		EXPECT_CALL(memory(), read(addr(&RTC->CRL)))
			.Times(2)
			.WillRepeatedly([this] (auto)
			{
				rtoff_ = !rtoff_;
				return rtoff_ ? RTC_CRL_RTOFF : 0;
			});
	}
	
