dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
public:
	static constexpr mcutl::datetime::timestamp_t test_timestamp = 0x12345678u;
	
private:
	bool rtoff_ = true;
	bool rsf_ = true;
};

TEST_F(rtc_strict_test_fixture, TraitsTest)
{
	EXPECT_TRUE(mcutl::rtc::supports_alarm);
	EXPECT_TRUE(mcutl::rtc::supports_second_interrupt);
	EXPECT_TRUE(mcutl::rtc::supports_overflow_interrupt);
	EXPECT_TRUE(mcutl::rtc::supports_internal_clock_source);
	EXPECT_FALSE(mcutl::rtc::supports_atomic_clear_pending_flags);
	EXPECT_EQ(mcutl::rtc::min_prescaler, 1u);
	EXPECT_EQ(mcutl::rtc::max_prescaler, 0xfffffu);
	EXPECT_FALSE(mcutl::rtc::prescaler_supported<0>);
	EXPECT_FALSE(mcutl::rtc::prescaler_supported<0x100000u>);
	EXPECT_TRUE(mcutl::rtc::prescaler_supported<123>);
	
	EXPECT_TRUE((std::is_same_v<mcutl::rtc::peripheral_type,
		mcutl::types::list<mcutl::periph::pwr, mcutl::periph::bkp>>));
	EXPECT_TRUE((std::is_same_v<mcutl::rtc::interrupt_type<mcutl::rtc::interrupt::alarm>,
		mcutl::interrupt::type::rtc>));
	EXPECT_TRUE((std::is_same_v<mcutl::rtc::interrupt_type<mcutl::rtc::interrupt::overflow>,
		mcutl::interrupt::type::rtc>));
	EXPECT_TRUE((std::is_same_v<mcutl::rtc::interrupt_type<mcutl::rtc::interrupt::second>,
		mcutl::interrupt::type::rtc>));
	EXPECT_TRUE((std::is_same_v<mcutl::rtc::interrupt_type<mcutl::rtc::interrupt::external_alarm>,
		mcutl::interrupt::type::rtc_alarm>));
}

TEST_F(rtc_strict_test_fixture, ClearPendingFlagsTest)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(false);
	
	EXPECT_CALL(memory(), write(addr(&RTC->CRL), RTC_CRL_OWF | RTC_CRL_RSF));
	
	expect_disable_rtc_config(false);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::clear_pending_flags<mcutl::rtc::interrupt::alarm,
		mcutl::rtc::interrupt::second>();
}

TEST_F(rtc_strict_test_fixture, ClearPendingFlagsWithExternalAlarmTest)
{
	::testing::InSequence s;
	
	EXPECT_CALL(memory(), write(addr(&EXTI->PR), 1 << mcutl::exti::rtc_alarm_line::value));
	
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(false);
	
	EXPECT_CALL(memory(), write(addr(&RTC->CRL), RTC_CRL_RSF));
	
	expect_disable_rtc_config(false);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::clear_pending_flags<mcutl::rtc::interrupt::overflow,
		mcutl::rtc::interrupt::second,
		mcutl::rtc::interrupt::external_alarm>();
}

TEST_F(rtc_strict_test_fixture, IsEnabledTest)
{
	memory().allow_reads(addr(&RCC->BDCR));
	EXPECT_FALSE(mcutl::rtc::is_enabled());
	
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN);
	EXPECT_FALSE(mcutl::rtc::is_enabled());
	
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCSEL_HSE);
	EXPECT_FALSE(mcutl::rtc::is_enabled());
	
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_HSE);
	EXPECT_TRUE(mcutl::rtc::is_enabled());
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_LSE);
	EXPECT_TRUE(mcutl::rtc::is_enabled());
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_LSI);
	EXPECT_TRUE(mcutl::rtc::is_enabled());
}

TEST_F(rtc_strict_test_fixture, HasAlarmedTest)
{
	::testing::InSequence s;
	
	expect_enable_rtc_config(false);
	EXPECT_CALL(memory(), read(addr(&RTC->CRL)))
		.WillOnce([] (auto) { return 0; });
	EXPECT_FALSE(mcutl::rtc::has_alarmed());
	
	expect_enable_rtc_config(false);
	EXPECT_CALL(memory(), read(addr(&RTC->CRL)))
		.WillOnce([] (auto) { return RTC_CRL_ALRF; });
	EXPECT_TRUE(mcutl::rtc::has_alarmed());
}

struct timestamp_only
{
	mcutl::datetime::timestamp_t timestamp = 0;
};

TEST_F(rtc_strict_test_fixture, GetTimestampTest)
{
	memory().set(addr(&RTC->CNTH), 0x1234);
	memory().set(addr(&RTC->CNTL), 0x5678);
	
	expect_rtc_value_read();
	
	timestamp_only result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(result.timestamp, 0x12345678u);
}

TEST_F(rtc_strict_test_fixture, TimestampChangedWhenReatingTest)
{
	::testing::Sequence s1, s2;
	expect_enable_rtc_config(false, s1, s2);
	EXPECT_CALL(memory(), read(addr(&RTC->CNTH)))
		.Times(2)
		.InSequence(s1)
		.WillOnce([] (auto) { return 0x1234u; })
		.WillRepeatedly([] (auto) { return 0x1235u; });
	EXPECT_CALL(memory(), read(addr(&RTC->CNTL)))
		.Times(2)
		.InSequence(s2)
		.WillOnce([] (auto) { return 0xffff; })
		.WillRepeatedly([] (auto) { return 0x1u; });
	
	timestamp_only result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(result.timestamp, 0x12350001u);
}

TEST_F(rtc_strict_test_fixture, GetDateTest)
{
	memory().set(addr(&RTC->CNTH), test_timestamp >> 16);
	memory().set(addr(&RTC->CNTL), test_timestamp & 0xffff);
	
	expect_rtc_value_read();
	
	mcutl::datetime::date_value result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(result.day, mcutl::datetime::date_from_timestamp(test_timestamp).day);
	EXPECT_EQ(result.month, mcutl::datetime::date_from_timestamp(test_timestamp).month);
	EXPECT_EQ(result.year, mcutl::datetime::date_from_timestamp(test_timestamp).year);
}

TEST_F(rtc_strict_test_fixture, GetTimeTest)
{
	memory().set(addr(&RTC->CNTH), test_timestamp >> 16);
	memory().set(addr(&RTC->CNTL), test_timestamp & 0xffff);
	
	expect_rtc_value_read();
	
	mcutl::datetime::time_value result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(result.second, mcutl::datetime::time_from_timestamp(test_timestamp).second);
	EXPECT_EQ(result.minute, mcutl::datetime::time_from_timestamp(test_timestamp).minute);
	EXPECT_EQ(result.hour, mcutl::datetime::time_from_timestamp(test_timestamp).hour);
}

TEST_F(rtc_strict_test_fixture, GetDateTimeWithTimestampTest)
{
	memory().set(addr(&RTC->CNTH), test_timestamp >> 16);
	memory().set(addr(&RTC->CNTL), test_timestamp & 0xffff);
	
	expect_rtc_value_read();
	
	mcutl::datetime::date_time_with_timestamp result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(result.timestamp, test_timestamp);
	EXPECT_EQ(mcutl::datetime::timestamp_from_date_time(result), test_timestamp);
}

TEST_F(rtc_strict_test_fixture, GetDateTimeTest)
{
	memory().set(addr(&RTC->CNTH), test_timestamp >> 16);
	memory().set(addr(&RTC->CNTL), test_timestamp & 0xffff);
	
	expect_rtc_value_read();
	
	mcutl::datetime::date_time result;
	mcutl::rtc::get_date_time(result);
	EXPECT_EQ(mcutl::datetime::timestamp_from_date_time(result), test_timestamp);
}

