dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
TEST_F(rtc_strict_test_fixture, SetTimestampTest)
{
	expect_set_rtc_value();
	mcutl::rtc::set_date_time(test_timestamp);
}

TEST_F(rtc_strict_test_fixture, SetDateTimeTest1)
{
	expect_set_rtc_value();
	mcutl::rtc::set_date_time(mcutl::datetime::date_time_from_timestamp(test_timestamp));
}

TEST_F(rtc_strict_test_fixture, SetDateTimeTest2)
{
	expect_set_rtc_value();
	mcutl::datetime::date_time_with_timestamp result {};
	static_cast<mcutl::datetime::date_time&>(result)
		= mcutl::datetime::date_time_from_timestamp(test_timestamp);
	mcutl::rtc::set_date_time(result);
}

TEST_F(rtc_strict_test_fixture, DisableAlarmTest)
{
	memory().set(addr(&RTC->CRH), 0xffffffffu);
	
	::testing::InSequence s;
	
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(false);
	
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	EXPECT_CALL(memory(), write(addr(&RTC->CRH), 0xffffffffu & ~RTC_CRH_ALRIE));
	EXPECT_CALL(memory(), write(addr(&RTC->CRL), RTC_CRL_SECF | RTC_CRL_OWF | RTC_CRL_RSF));
	
	expect_disable_rtc_config(false);
	expect_disable_backup_writes(true, false);
	
	EXPECT_CALL(memory(), write(addr(&EXTI->PR), 1 << mcutl::exti::rtc_alarm_line::value));
	
	mcutl::rtc::disable_alarm();
}

TEST_F(rtc_strict_test_fixture, SetAlarmTimestampTest)
{
	expect_set_alarm_value();
	mcutl::rtc::set_alarm(test_timestamp);
}

TEST_F(rtc_strict_test_fixture, SetAlarmDateTimeTest1)
{
	expect_set_alarm_value();
	auto result = mcutl::datetime::date_time_from_timestamp(test_timestamp);
	mcutl::rtc::set_alarm(result);
}

TEST_F(rtc_strict_test_fixture, SetAlarmDateTimeTest2)
{
	expect_set_alarm_value();
	mcutl::datetime::date_time_with_timestamp result {};
	static_cast<mcutl::datetime::date_time&>(result)
		= mcutl::datetime::date_time_from_timestamp(test_timestamp);
	mcutl::rtc::set_alarm(result);
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigComplexTest1)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_lsi();
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI);
	expect_enable_rtc_config(true);
	expect_set_rtc_prescaler(40000);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::internal,
		mcutl::rtc::clock::one_second_prescaler,
		mcutl::rtc::enable<true>,
		mcutl::rtc::base_configuration_is_currently_present
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigComplexTest2)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_lse(RCC_BDCR_LSEON);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON);
	expect_enable_rtc_config(true);
	expect_set_rtc_prescaler(32767);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::external_crystal,
		mcutl::rtc::clock::one_second_prescaler,
		mcutl::rtc::base_configuration_is_currently_present
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigComplexTest3)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_lse(RCC_BDCR_LSEON | RCC_BDCR_LSEBYP);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSEBYP);
	expect_enable_rtc_config(true);
	expect_set_rtc_prescaler(32767);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure <
		mcutl::rtc::clock::lse_bypass,
		mcutl::rtc::clock::one_second_prescaler,
		mcutl::rtc::base_configuration_is_currently_present,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::overflow>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::second>
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigComplexTest4)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE);
	expect_enable_rtc_config(true);
	expect_set_crh(RTC_CRH_ALRIE | RTC_CRH_OWIE);
	expect_set_rtc_prescaler(12345);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, true);
	memory().set(addr(&RCC->BDCR), 0);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::hse_div_128,
		mcutl::rtc::clock::prescaler<12345>,
		mcutl::rtc::enable<true>,
		mcutl::rtc::base_configuration_is_currently_present,
		mcutl::rtc::interrupt::external_alarm,
		mcutl::rtc::interrupt::overflow
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigAndInterruptsComplexTest1)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE);
	expect_enable_rtc_config(true);
	expect_set_crh(RTC_CRH_ALRIE | RTC_CRH_OWIE);
	expect_set_rtc_prescaler(12345);
	expect_disable_rtc_config(true);
	expect_enable_disable_alarm_line(false);
	expect_disable_interrupt(RTC_Alarm_IRQn);
	expect_enable_interrupt(RTC_IRQn);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, true);
	memory().set(addr(&RCC->BDCR), 0);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::hse_div_128,
		mcutl::rtc::clock::prescaler<12345>,
		mcutl::rtc::enable<true>,
		mcutl::rtc::base_configuration_is_currently_present,
		mcutl::rtc::interrupt::alarm,
		mcutl::rtc::interrupt::overflow,
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::disable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigAndInterruptsComplexTest2)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE);
	expect_enable_rtc_config(true);
	expect_set_crh(RTC_CRH_ALRIE | RTC_CRH_OWIE);
	expect_set_rtc_prescaler(12345);
	expect_disable_rtc_config(true);
	expect_enable_interrupt(RTC_IRQn, 5, 4);
	expect_enable_disable_alarm_line(true);
	expect_enable_interrupt(RTC_Alarm_IRQn, 3, 2);
	expect_disable_backup_writes(true, true);
	memory().set(addr(&RCC->BDCR), 0);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::hse_div_128,
		mcutl::rtc::clock::prescaler<12345>,
		mcutl::rtc::base_configuration_is_currently_present,
		mcutl::interrupt::interrupt<mcutl::rtc::interrupt::external_alarm, 3, 2>,
		mcutl::interrupt::interrupt<mcutl::rtc::interrupt::overflow, 5, 4>,
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::disable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureWithBaseConfigAndInterruptsComplexTest3)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE);
	expect_enable_rtc_config(true);
	expect_set_crh(RTC_CRH_ALRIE);
	expect_set_rtc_prescaler(12345);
	expect_disable_rtc_config(true);
	expect_disable_interrupt(RTC_IRQn);
	expect_enable_disable_alarm_line(true);
	expect_enable_interrupt(RTC_Alarm_IRQn, 3, 2);
	expect_disable_backup_writes(true, true);
	memory().set(addr(&RCC->BDCR), 0);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::hse_div_128,
		mcutl::rtc::clock::prescaler<12345>,
		mcutl::rtc::base_configuration_is_currently_present,
		mcutl::interrupt::interrupt<mcutl::rtc::interrupt::external_alarm, 3, 2>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>,
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::disable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureComplexTest1)
{
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCSEL_LSI);
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI);
	expect_enable_rtc_config(true);
	expect_set_crh(0);
	expect_set_rtc_prescaler(40000);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::internal,
		mcutl::rtc::clock::one_second_prescaler,
		mcutl::rtc::enable<true>
	>();
}

