dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
TEST_F(rtc_strict_test_fixture, ConfigureComplexTest2)
{
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN | RCC_BDCR_LSEON);
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_disable_lse(0);
	expect_enable_lse(RCC_BDCR_LSEON | RCC_BDCR_LSEBYP);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSEBYP);
	expect_enable_rtc_config(true);
	expect_set_crh(0);
	expect_set_rtc_prescaler(32767);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSEBYP | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::lse_bypass,
		mcutl::rtc::clock::one_second_prescaler,
		mcutl::rtc::enable<true>
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureComplexTest3)
{
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCEN);
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_disable_lse(0);
	expect_enable_lsi();
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI);
	expect_enable_rtc_config(true);
	expect_set_crh(0);
	expect_set_rtc_prescaler(123);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSI | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::lsi,
		mcutl::rtc::clock::prescaler<123>,
		mcutl::rtc::enable<true>
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureComplexTest4)
{
	memory().set(addr(&RCC->BDCR), RCC_BDCR_LSEON | RCC_BDCR_LSERDY);
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_enable_lse(RCC_BDCR_LSEON | RCC_BDCR_LSERDY);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON);
	expect_enable_rtc_config(true);
	expect_set_crh(0);
	expect_set_rtc_prescaler(123);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::configure<
		mcutl::rtc::clock::lse_crystal,
		mcutl::rtc::clock::prescaler<123>,
		mcutl::rtc::enable<true>
	>();
}

TEST_F(rtc_strict_test_fixture, ConfigureComplexTest5)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_reset_backup_domain(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE);
	expect_enable_rtc_config(true);
	expect_set_crh(0);
	expect_set_rtc_prescaler(123);
	expect_disable_rtc_config(true);
	expect_set_bdcr(RCC_BDCR_RTCSEL_HSE | RCC_BDCR_RTCEN);
	expect_disable_backup_writes(true, true);
	
	memory().set(addr(&RCC->BDCR), RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY);
	mcutl::rtc::configure<
		mcutl::rtc::clock::hse_div_128,
		mcutl::rtc::clock::prescaler<123>,
		mcutl::rtc::enable<true>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureEmptyTest)
{
	mcutl::rtc::reconfigure();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest1)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	EXPECT_CALL(memory(), read(addr(&RCC->BDCR)));
	expect_set_bdcr(RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	mcutl::rtc::reconfigure<
		mcutl::rtc::enable<false>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest2)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	expect_set_rtc_prescaler(123);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	mcutl::rtc::reconfigure<
		mcutl::rtc::clock::prescaler<123>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest3)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_SECIE | RTC_CRH_OWIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::overflow
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest4)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_ALRIE | RTC_CRH_OWIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest5)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE | RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::external_alarm
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest6)
{
	enable_interrupt(0);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE | RTC_CRH_ALRIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>
	>();
}

