dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest7)
{
	enable_interrupt(0);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE | RTC_CRH_ALRIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest8)
{
	enable_interrupt(RTC_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE | RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE | RTC_CRH_ALRIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest9)
{
	enable_interrupt(RTC_Alarm_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE | RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE | RTC_CRH_ALRIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureComplexTest10)
{
	enable_interrupt(RTC_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_OWIE);
	expect_disable_rtc_config(true);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RCC->BDCR),
		RCC_BDCR_RTCSEL_LSE | RCC_BDCR_LSEON | RCC_BDCR_LSERDY | RCC_BDCR_RTCEN);
	memory().set(addr(&RTC->CRH), RTC_CRH_OWIE);
	mcutl::rtc::reconfigure<
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest1)
{
	memory().allow_reads(addr(&RTC->CRH));
	
	expect_disable_interrupt(RTC_IRQn);
	expect_enable_disable_alarm_line(false);
	expect_disable_interrupt(RTC_Alarm_IRQn);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::disable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest2)
{
	memory().allow_reads(addr(&RTC->CRH));
	memory().set(addr(&RTC->CRH), RTC_CRH_ALRIE);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::disable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest3)
{
	enable_interrupt(RTC_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_SECIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_disable_alarm_line(false);
	expect_disable_interrupt(RTC_Alarm_IRQn);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RTC->CRH), RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::disable_controller_interrupts,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest4)
{
	memory().allow_reads(addr(&RTC->CRH));
	expect_enable_interrupt(RTC_IRQn);
	
	memory().set(addr(&RTC->CRH), RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest5)
{
	memory().allow_reads(addr(&RTC->CRH));
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest6)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_disable_alarm_line(true);
	expect_enable_interrupt(RTC_Alarm_IRQn);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::external_alarm
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest7)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_interrupt(RTC_IRQn);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::alarm
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest8)
{
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_interrupt(RTC_IRQn);
	expect_enable_disable_alarm_line(true);
	expect_enable_interrupt(RTC_Alarm_IRQn);
	expect_disable_backup_writes(true, false);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::rtc::interrupt::alarm,
		mcutl::rtc::interrupt::external_alarm
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest9)
{
	memory().allow_reads(addr(&RTC->CRH));
	expect_enable_interrupt(RTC_IRQn);
	
	memory().set(addr(&RTC->CRH), RTC_CRH_ALRIE);
	
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest10)
{
	enable_interrupt(RTC_Alarm_IRQn);
	enable_interrupt(RTC_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_SECIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_disable_alarm_line(false);
	expect_disable_interrupt(RTC_Alarm_IRQn);
	expect_disable_backup_writes(true, false);
	
