dragon-dreamer/mcutl/tests/stm32f1_rtc_tests.cpp
	memory().set(addr(&RTC->CRH), RTC_CRH_ALRIE | RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::disable_controller_interrupts,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::alarm>
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest11)
{
	enable_interrupt(RTC_Alarm_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_SECIE | RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_disable_alarm_line(false);
	expect_disable_interrupt(RTC_Alarm_IRQn);
	expect_enable_interrupt(RTC_IRQn);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RTC->CRH), RTC_CRH_ALRIE | RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::disable_controller_interrupts,
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::interrupt::disabled<mcutl::rtc::interrupt::external_alarm>,
		mcutl::rtc::interrupt::alarm
	>();
}

TEST_F(rtc_strict_test_fixture, ReConfigureInterruptsTest12)
{
	enable_interrupt(RTC_IRQn);
	
	::testing::InSequence s;
	expect_enable_backup_writes(false);
	expect_enable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_set_crh(RTC_CRH_SECIE | RTC_CRH_ALRIE);
	expect_disable_rtc_config(true);
	EXPECT_CALL(memory(), read(addr(&RTC->CRH)));
	expect_enable_interrupt(RTC_IRQn);
	expect_enable_disable_alarm_line(true);
	expect_enable_interrupt(RTC_Alarm_IRQn, 2, 3);
	expect_disable_backup_writes(true, false);
	
	memory().set(addr(&RTC->CRH), RTC_CRH_SECIE);
	mcutl::rtc::reconfigure<
		mcutl::rtc::interrupt::enable_controller_interrupts,
		mcutl::interrupt::interrupt<mcutl::rtc::interrupt::external_alarm, 2, 3>,
		mcutl::rtc::interrupt::alarm
	>();
}
